[
  {
    "id": 1,
    "title": "Spaghetti Carbonara",
    "summary": "A classic Italian pasta dish with eggs, cheese, bacon, and black pepper.",
    "image": "https://placehold.co/600x400/FF5733/FFFFFF?text=Spaghetti+Carbonara",
    "ingredients": [
      "200g spaghetti",
      "100g pancetta or guanciale",
      "2 large eggs",
      "50g Pecorino Romano cheese, grated",
      "Freshly ground black pepper",
      "Salt to taste"
    ],
    "instructions": [
      "Cook spaghetti according to package directions in salted water.",
      "While spaghetti cooks, cut pancetta/guanciale into small cubes and crisp it in a pan over medium heat until golden and fat is rendered. Remove crispy bits, leaving fat in pan.",
      "In a bowl, whisk eggs, half of the Pecorino, and a generous amount of black pepper until well combined.",
      "Drain spaghetti, reserving about 1 cup of the hot pasta water. Add the hot, drained spaghetti directly to the pan with the pancetta fat. Toss to coat.",
      "Quickly pour the egg mixture over the hot pasta, stirring vigorously to emulsify. Add a splash or two of the reserved pasta water to create a creamy, velvety sauce. Keep stirring until the sauce coats the pasta beautifully. Do NOT cook the eggs; the heat from the pasta will cook them gently.",
      "Stir in the crispy pancetta bits. Serve immediately, garnished with remaining Pecorino cheese and more freshly ground black pepper."
    ]
  },
  {
    "id": 2,
    "title": "Chicken Tikka Masala",
    "summary": "Chunks of grilled chicken (tikka) cooked in a smooth buttery & creamy tomato based gravy.",
    "image": "https://placehold.co/600x400/33FF57/FFFFFF?text=Chicken+Tikka+Masala",
    "ingredients": [
      "500g boneless chicken, cut into 1-inch pieces",
      "1 cup plain yogurt",
      "2 tbsp ginger-garlic paste",
      "1 tsp turmeric powder",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "Salt to taste",
      "2 tbsp vegetable oil",
      "1 large onion, finely chopped",
      "1 can (400g) crushed tomatoes",
      "1/2 cup heavy cream",
      "Fresh cilantro for garnish",
      "1 tsp garam masala"
    ],
    "instructions": [
      "Marinate chicken with yogurt, 1 tbsp ginger-garlic paste, 1/2 tsp turmeric, 1/2 tsp cumin, 1/2 tsp coriander, 1/4 tsp red chili powder, and salt. Mix well and let it sit for at least 30 minutes (or ideally, 4 hours in the fridge).",
      "Heat 1 tbsp oil in a large pan or Dutch oven over medium-high heat. Add the marinated chicken and cook until lightly browned on all sides. Remove chicken and set aside.",
      "In the same pan, add remaining 1 tbsp oil. Add chopped onion and cook until softened and translucent, about 5-7 minutes.",
      "Add remaining ginger-garlic paste, turmeric, cumin, coriander, and red chili powder. Cook for 1-2 minutes, stirring constantly, until fragrant.",
      "Stir in the crushed tomatoes. Bring to a simmer, then reduce heat to low, cover, and cook for 15-20 minutes, stirring occasionally, until the sauce thickens and oil separates.",
      "Return the cooked chicken to the pan. Stir in garam masala and heavy cream. Simmer for another 5 minutes, allowing the flavors to meld and the sauce to warm through.",
      "Garnish with fresh cilantro and serve hot with basmati rice or naan bread."
    ]
  },
  {
    "id": 3,
    "title": "Vegetable Stir-fry",
    "summary": "A quick and healthy dish packed with colorful vegetables and a savory sauce.",
    "image": "https://placehold.co/600x400/3366FF/FFFFFF?text=Vegetable+Stir-fry",
    "ingredients": [
      "2 cups mixed vegetables (e.g., broccoli florets, sliced carrots, bell peppers, snap peas, mushrooms)",
      "1 tbsp soy sauce",
      "1 tbsp oyster sauce (optional, for umami)",
      "1 tsp sesame oil",
      "1 clove garlic, minced",
      "1/2 inch fresh ginger, grated",
      "1 tbsp vegetable oil",
      "1/4 cup vegetable broth or water"
    ],
    "instructions": [
      "Prepare all vegetables: wash, chop, and set aside. Mince garlic and grate ginger.",
      "In a small bowl, whisk together soy sauce, oyster sauce (if using), sesame oil, and vegetable broth/water. Set aside.",
      "Heat vegetable oil in a large wok or skillet over high heat until shimmering.",
      "Add minced garlic and grated ginger; stir-fry for 30 seconds until fragrant.",
      "Add harder vegetables (e.g., broccoli, carrots, bell peppers) to the wok. Stir-fry for 2-3 minutes until slightly tender-crisp.",
      "Add softer vegetables (e.g., snap peas, mushrooms) and stir-fry for another 1-2 minutes.",
      "Pour the prepared sauce mixture over the vegetables and toss quickly to coat. Cook for 1 minute more, allowing the sauce to thicken slightly and vegetables to be heated through.",
      "Serve immediately with steamed rice or noodles for a complete meal."
    ]
  },
  {
    "id": 4,
    "title": "Classic Pancakes",
    "summary": "Fluffy, golden pancakes perfect for breakfast or brunch.",
    "image": "https://placehold.co/600x400/FF9933/FFFFFF?text=Classic+Pancakes",
    "ingredients": [
      "1 1/2 cups all-purpose flour",
      "3 1/2 tsp baking powder",
      "1 tsp salt",
      "1 tbsp white sugar",
      "1 1/4 cups milk",
      "1 large egg",
      "3 tbsp unsalted butter, melted"
    ],
    "instructions": [
      "In a large bowl, whisk together the dry ingredients: flour, baking powder, salt, and sugar. Ensure there are no large lumps.",
      "In a separate medium bowl, whisk together the wet ingredients: milk, egg, and melted butter until well combined.",
      "Pour the wet ingredients into the dry ingredients. Stir until just combined. It's okay if there are still a few lumps; overmixing can make pancakes tough.",
      "Heat a lightly oiled griddle or large non-stick frying pan over medium-high heat. Test the heat by sprinkling a few drops of water; they should sizzle immediately.",
      "Pour 1/4 cup of batter for each pancake onto the hot griddle. Leave some space between pancakes.",
      "Cook for 2-3 minutes per side, or until golden brown and bubbles appear on the surface of the pancake. Flip carefully with a spatula.",
      "Cook the other side for another 1-2 minutes until golden brown and cooked through.",
      "Serve hot with your favorite toppings such as syrup, fresh berries, whipped cream, or chocolate chips."
    ]
  }
]